Documents/Лео_УстановкаСоответствияНоменклатурыНепрямыхКлиентов/Лео_УстановкаСоответствияНоменклатурыНепрямыхКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_УстановкаСоответствияНоменклатурыНепрямыхКлиентов</name>
  <registerRecords>InformationRegister.Лео_СоответствиеНоменклатурыНепрямыхКлиентов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СетьТорговаяТочка</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеНоменклатуры</name>
    <attributes>
      <name>СетьТорговаяТочка</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулВСистемеКлиента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВСистемеКлиента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/Лео_СоответствиеНоменклатурыНепрямыхКлиентов/Лео_СоответствиеНоменклатурыНепрямыхКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_СоответствиеНоменклатурыНепрямыхКлиентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СетьТорговаТочка</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АртикулВСистемеКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НаименованиеВСистемеКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/Лео_УстановкаСоответствияНоменклатурыНепрямыхКлиентов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_СоответствиеНоменклатурыНепрямыхКлиентов.Записывать = Истина;
	Движения.Лео_СоответствиеНоменклатурыНепрямыхКлиентов.Очистить();
	Для Каждого ТекСтрокаСоответствиеНоменклатуры Из СоответствиеНоменклатуры Цикл
		Движение = Движения.Лео_СоответствиеНоменклатурыНепрямыхКлиентов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.СетьТорговаТочка = ТекСтрокаСоответствиеНоменклатуры.СетьТорговаяТочка;
		Движение.Номенклатура = ТекСтрокаСоответствиеНоменклатуры.Номенклатура;
		Движение.АртикулВСистемеКлиента = ТекСтрокаСоответствиеНоменклатуры.АртикулВСистемеКлиента;
		Движение.НаименованиеВСистемеКлиента = ТекСтрокаСоответствиеНоменклатуры.НаименованиеВСистемеКлиента;
	КонецЦикла;
КонецПроцедуры
